export const regPhone =
	// eslint-disable-next-line no-useless-escape
	/^[\+]?[(]?[0-9]{3}[)]?[-\s\.]?[0-9]{3}[-\s\.]?[0-9]{4,6}$/g;
/* 
	Matches:
	+919367788755
	8989829304
	+16308520397
	786-307-3615
*/

/* ################################### */

export const regDate =
	/^(?:(?:31(\/|-|\.)(?:0?[13578]|1[02]|(?:Jan|Mar|May|Jul|Aug|Oct|Dec)))\1|(?:(?:29|30)(\/|-|\.)(?:0?[1,3-9]|1[0-2]|(?:Jan|Mar|Apr|May|Jun|Jul|Aug|Sep|Oct|Nov|Dec))\2))(?:(?:1[6-9]|[2-9]\d)?\d{2})$|^(?:29(\/|-|\.)(?:0?2|(?:Feb))\3(?:(?:(?:1[6-9]|[2-9]\d)?(?:0[48]|[2468][048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26])00))))$|^(?:0?[1-9]|1\d|2[0-8])(\/|-|\.)(?:(?:0?[1-9]|(?:Jan|Feb|Mar|Apr|May|Jun|Jul|Aug|Sep))|(?:1[0-2]|(?:Oct|Nov|Dec)))\4(?:(?:1[6-9]|[2-9]\d)?\d{2})$/g;
/* Matches:
	01/01/2000
	31/01/2000
	32/01/2000
	01-1-2000
	1.1.2019
 */

/* ################################### */

export const regOmitNumbers = /[0-9]/g;
/* 
	Matches:
	1
	25
	394
	...
*/

/* 
Matches:
01/01/2000
31/01/2000
32/01/2000
01-1-2000
1.1.2019 
*/

/* ################################### */

export const regOmitLetters = /[A-Za-zА-Яа-яЁё]/g;
/* 
Matches:
lorem
a
ab
abcde
john doe
johnny
abcdefghijklmnopqrst
Текст 
абвгд
*/

/* ################################### */

export const regIndex = /[0-9]/g;
/* 
	Matches:
	1
	25
	394
	...
*/
